In [2]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
series = pd.Series([ 4, 8, 15, 16, 23,42])

In [4]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [6]:
l=[1,2,3,4,5,6,7,8,9,10]
series1=pd.Series(l)
series1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female
Then, print the DataFrame.

In [7]:
d={'Name':['Alice','Bob','Claire'],
   'Age':[25,30,27],
  'Gender':['Female','Male','Female']}

In [8]:
data=pd.DataFrame(d)
data

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a DataFrame is a two-dimensional labeled data structure with columns that can be of different types (numeric, string, boolean, etc.). It can be thought of as a spreadsheet or SQL table, where data is organized in rows and columns.
a pandas Series is a one-dimensional labeled array capable of holding any data type. It can be thought of as a single column of a DataFrame.

In [3]:
d={'Name':['Alice','Bob','Claire'],
   'Age':[25,30,27],
  'Gender':['Female','Male','Female']}
data=pd.DataFrame(d)
data

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [5]:
seriesdata=pd.Series(data['Name'])

In [6]:
seriesdata

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [7]:
data.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [8]:
data.tail(2)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [12]:
data.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [13]:
data.set_index('Name')

        Age  Gender
Name
Alice    25  Female
Bob      30    Male
Claire   27  Female

In [14]:
data.reset_index()

   index    Name  Age  Gender
0      0   Alice   25  Female
1      1     Bob   30    Male
2      2  Claire   27  Female

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

 Series, DataFrame

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [15]:
data1=pd.Series([1,2,3,4,5])
data2=pd.Series(['mithin','sake','chay','shiv','pooja'])

In [18]:
df=pd.DataFrame([data1,data2])

In [19]:
df

        0     1     2     3      4
0       1     2     3     4      5
1  mithin  sake  chay  shiv  pooja